{"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "Embedding", "config": {"name": "embedding", "batch_input_shape": [null, 40], "trainable": true, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "seed": null, "maxval": 0.05, "dtype": "float32"}}, "mask_zero": false, "embeddings_constraint": null, "output_dim": 128, "activity_regularizer": null, "input_length": 40, "input_dim": 2000, "embeddings_regularizer": null, "dtype": "float32"}}, {"class_name": "SpatialDropout1D", "config": {"name": "spatial_dropout1d", "noise_shape": null, "trainable": true, "dtype": "float32", "rate": 0.4, "seed": null}}, {"class_name": "LSTM", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "activation": "tanh", "return_state": false, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "recurrent_dropout": 0.2, "implementation": 1, "recurrent_constraint": null, "dropout": 0.2, "unroll": false, "name": "lstm", "use_bias": true, "stateful": false, "time_major": false, "recurrent_regularizer": null, "kernel_regularizer": null, "dtype": "float32", "units": 128, "kernel_constraint": null, "trainable": true, "unit_forget_bias": true, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "go_backwards": false, "activity_regularizer": null, "bias_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null, "dtype": "float32"}}, "return_sequences": false}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "activation": "softmax", "units": 2, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "bias_constraint": null, "name": "dense", "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "dtype": "float32"}}]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}