{"keras_version": "2.2.4-tf", "config": {"name": "sequential", "layers": [{"config": {"name": "embedding", "embeddings_initializer": {"config": {"dtype": "float32", "minval": -0.05, "seed": null, "maxval": 0.05}, "class_name": "RandomUniform"}, "mask_zero": false, "batch_input_shape": [null, 40], "input_length": 40, "embeddings_regularizer": null, "dtype": "float32", "trainable": true, "input_dim": 2000, "activity_regularizer": null, "embeddings_constraint": null, "output_dim": 128}, "class_name": "Embedding"}, {"config": {"noise_shape": null, "name": "spatial_dropout1d", "seed": null, "dtype": "float32", "trainable": true, "rate": 0.4}, "class_name": "SpatialDropout1D"}, {"config": {"units": 256, "dropout": 0.2, "activation": "tanh", "name": "lstm", "kernel_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "recurrent_initializer": {"config": {"gain": 1.0, "dtype": "float32", "seed": null}, "class_name": "Orthogonal"}, "unit_forget_bias": true, "return_sequences": false, "activity_regularizer": null, "return_state": false, "bias_regularizer": null, "go_backwards": false, "recurrent_constraint": null, "recurrent_regularizer": null, "bias_constraint": null, "trainable": true, "recurrent_dropout": 0.2, "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "kernel_regularizer": null, "dtype": "float32", "time_major": false, "implementation": 1, "stateful": false, "use_bias": true, "unroll": false, "recurrent_activation": "hard_sigmoid"}, "class_name": "LSTM"}, {"config": {"activation": "softmax", "units": 2, "bias_constraint": null, "dtype": "float32", "name": "dense", "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "trainable": true, "use_bias": true, "activity_regularizer": null, "bias_regularizer": null}, "class_name": "Dense"}]}, "backend": "tensorflow", "class_name": "Sequential"}