{"config": {"name": "sequential", "layers": [{"config": {"dtype": "float32", "name": "embedding", "input_dim": 2000, "batch_input_shape": [null, 40], "input_length": 40, "mask_zero": false, "output_dim": 128, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "trainable": true, "embeddings_initializer": {"config": {"seed": null, "minval": 0, "maxval": null, "dtype": "float32"}, "class_name": "RandomUniform"}}, "class_name": "Embedding"}, {"config": {"dtype": "float32", "name": "spatial_dropout1d", "noise_shape": null, "trainable": true, "seed": null, "rate": 0.4}, "class_name": "SpatialDropout1D"}, {"config": {"return_sequences": false, "name": "lstm", "unroll": false, "recurrent_regularizer": null, "stateful": false, "dropout": 0.2, "unit_forget_bias": true, "activity_regularizer": null, "activation": "tanh", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "dtype": "float32"}, "class_name": "VarianceScaling"}, "dtype": "float32", "recurrent_dropout": 0.2, "bias_constraint": null, "return_state": false, "implementation": 1, "units": 196, "time_major": false, "kernel_constraint": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0, "dtype": "float32"}, "class_name": "Orthogonal"}, "trainable": true, "go_backwards": false, "recurrent_constraint": null, "kernel_regularizer": null, "recurrent_activation": "hard_sigmoid"}, "class_name": "LSTM"}, {"config": {"dtype": "float32", "name": "dense", "use_bias": true, "units": 2, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "dtype": "float32"}, "class_name": "VarianceScaling"}, "activation": "softmax"}, "class_name": "Dense"}]}, "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.2.4-tf"}