{"class_name": "Sequential", "keras_version": "2.2.4-tf", "config": {"layers": [{"class_name": "Embedding", "config": {"embeddings_constraint": null, "output_dim": 128, "mask_zero": false, "input_dim": 2000, "trainable": true, "embeddings_regularizer": null, "input_length": 40, "activity_regularizer": null, "dtype": "float32", "batch_input_shape": [null, 40], "name": "embedding", "embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": null, "minval": 0, "seed": null, "dtype": "float32"}}}}, {"class_name": "SpatialDropout1D", "config": {"trainable": true, "noise_shape": null, "rate": 0.4, "seed": null, "name": "spatial_dropout1d", "dtype": "float32"}}, {"class_name": "LSTM", "config": {"dtype": "float32", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "return_state": false, "use_bias": true, "stateful": false, "bias_regularizer": null, "recurrent_constraint": null, "go_backwards": false, "activity_regularizer": null, "implementation": 1, "recurrent_activation": "hard_sigmoid", "units": 196, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "dtype": "float32"}}, "unroll": false, "kernel_regularizer": null, "bias_constraint": null, "recurrent_regularizer": null, "unit_forget_bias": true, "kernel_constraint": null, "trainable": true, "time_major": false, "dropout": 0.2, "return_sequences": false, "recurrent_dropout": 0.2, "name": "lstm", "activation": "tanh"}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "dtype": "float32", "units": 2, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "dtype": "float32"}}, "name": "dense", "activation": "softmax"}}], "name": "sequential"}, "backend": "tensorflow"}