{"keras_version": "2.2.4-tf", "backend": "tensorflow", "class_name": "Sequential", "config": {"layers": [{"class_name": "Embedding", "config": {"name": "embedding", "dtype": "float32", "mask_zero": false, "output_dim": 128, "input_length": 40, "trainable": true, "input_dim": 2000, "activity_regularizer": null, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "dtype": "float32", "maxval": null, "minval": 0}}, "embeddings_constraint": null, "embeddings_regularizer": null, "batch_input_shape": [null, 40]}}, {"class_name": "SpatialDropout1D", "config": {"dtype": "float32", "trainable": true, "noise_shape": null, "seed": null, "name": "spatial_dropout1d", "rate": 0.4}}, {"class_name": "LSTM", "config": {"implementation": 1, "unit_forget_bias": true, "recurrent_regularizer": null, "kernel_constraint": null, "return_sequences": false, "dtype": "float32", "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "unroll": false, "recurrent_constraint": null, "stateful": false, "kernel_regularizer": null, "name": "lstm", "recurrent_dropout": 0.2, "time_major": false, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "dropout": 0.2, "go_backwards": false, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "dtype": "float32", "distribution": "uniform", "seed": null}}, "trainable": true, "activity_regularizer": null, "units": 196, "bias_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "dtype": "float32", "gain": 1.0}}, "return_state": false}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "dtype": "float32", "distribution": "uniform", "seed": null}}, "dtype": "float32", "trainable": true, "activation": "softmax", "activity_regularizer": null, "units": 2, "bias_regularizer": null, "name": "dense"}}], "name": "sequential"}}