{"backend": "tensorflow", "keras_version": "2.2.4-tf", "config": {"layers": [{"config": {"embeddings_regularizer": null, "name": "embedding", "dtype": "float32", "mask_zero": false, "embeddings_initializer": {"config": {"maxval": null, "dtype": "float32", "minval": 0, "seed": null}, "class_name": "RandomUniform"}, "activity_regularizer": null, "output_dim": 128, "embeddings_constraint": null, "trainable": true, "input_length": 40, "input_dim": 2000, "batch_input_shape": [null, 40]}, "class_name": "Embedding"}, {"config": {"trainable": true, "name": "spatial_dropout1d", "noise_shape": null, "dtype": "float32", "rate": 0.4, "seed": null}, "class_name": "SpatialDropout1D"}, {"config": {"recurrent_dropout": 0.2, "unit_forget_bias": true, "unroll": false, "return_state": false, "activity_regularizer": null, "units": 196, "recurrent_activation": "hard_sigmoid", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "trainable": true, "go_backwards": false, "recurrent_regularizer": null, "stateful": false, "return_sequences": false, "implementation": 1, "use_bias": true, "activation": "tanh", "name": "lstm", "dtype": "float32", "recurrent_constraint": null, "kernel_initializer": {"config": {"dtype": "float32", "scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "recurrent_initializer": {"config": {"dtype": "float32", "gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "dropout": 0.2, "kernel_regularizer": null, "time_major": false, "bias_constraint": null, "kernel_constraint": null}, "class_name": "LSTM"}, {"config": {"use_bias": true, "activation": "softmax", "name": "dense", "bias_regularizer": null, "dtype": "float32", "activity_regularizer": null, "kernel_initializer": {"config": {"dtype": "float32", "scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "units": 2, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "class_name": "Dense"}], "name": "sequential"}, "class_name": "Sequential"}