{"config": {"layers": [{"config": {"dtype": "float32", "embeddings_constraint": null, "embeddings_regularizer": null, "activity_regularizer": null, "mask_zero": false, "name": "embedding", "output_dim": 128, "input_length": 40, "batch_input_shape": [null, 40], "trainable": true, "input_dim": 2000, "embeddings_initializer": {"config": {"maxval": null, "minval": 0, "seed": null, "dtype": "float32"}, "class_name": "RandomUniform"}}, "class_name": "Embedding"}, {"config": {"rate": 0.4, "noise_shape": null, "trainable": true, "seed": null, "dtype": "float32", "name": "spatial_dropout1d"}, "class_name": "SpatialDropout1D"}, {"config": {"return_state": false, "bias_regularizer": null, "dropout": 0.2, "use_bias": true, "units": 196, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "dtype": "float32", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "go_backwards": false, "dtype": "float32", "recurrent_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "lstm", "recurrent_regularizer": null, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "stateful": false, "return_sequences": false, "activation": "tanh", "activity_regularizer": null, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_dropout": 0.2, "kernel_constraint": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null, "dtype": "float32"}, "class_name": "Orthogonal"}, "trainable": true, "unroll": false, "time_major": false, "implementation": 1}, "class_name": "LSTM"}, {"config": {"bias_regularizer": null, "use_bias": true, "units": 2, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "dtype": "float32", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activation": "softmax", "dtype": "float32", "name": "dense", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "bias_constraint": null}, "class_name": "Dense"}], "name": "sequential"}, "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.2.4-tf"}