{"class_name": "Sequential", "backend": "tensorflow", "config": {"name": "sequential", "layers": [{"class_name": "Embedding", "config": {"mask_zero": false, "output_dim": 128, "embeddings_regularizer": null, "name": "embedding", "input_length": 40, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": 0, "seed": null, "maxval": null, "dtype": "float32"}}, "activity_regularizer": null, "dtype": "float32", "input_dim": 2000, "embeddings_constraint": null, "batch_input_shape": [null, 40], "trainable": true}}, {"class_name": "SpatialDropout1D", "config": {"dtype": "float32", "seed": null, "noise_shape": null, "rate": 0.4, "name": "spatial_dropout1d", "trainable": true}}, {"class_name": "LSTM", "config": {"dropout": 0.2, "name": "lstm", "activation": "tanh", "stateful": false, "activity_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "return_state": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null, "dtype": "float32"}}, "implementation": 1, "use_bias": true, "recurrent_regularizer": null, "time_major": false, "bias_regularizer": null, "recurrent_constraint": null, "unit_forget_bias": true, "return_sequences": false, "recurrent_dropout": 0.2, "units": 196, "recurrent_activation": "hard_sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "unroll": false, "dtype": "float32", "go_backwards": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null, "dtype": "float32"}}, "trainable": true}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "activation": "softmax", "name": "dense", "kernel_regularizer": null, "units": 2, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null, "dtype": "float32"}}, "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true}}]}, "keras_version": "2.2.4-tf"}