{"keras_version": "2.2.4-tf", "config": {"layers": [{"config": {"trainable": true, "input_dim": 2000, "input_length": 40, "name": "embedding", "batch_input_shape": [null, 40], "dtype": "float32", "mask_zero": false, "embeddings_initializer": {"config": {"maxval": null, "seed": null, "minval": 0, "dtype": "float32"}, "class_name": "RandomUniform"}, "embeddings_constraint": null, "embeddings_regularizer": null, "output_dim": 128, "activity_regularizer": null}, "class_name": "Embedding"}, {"config": {"trainable": true, "noise_shape": null, "seed": null, "name": "spatial_dropout1d", "dtype": "float32", "rate": 0.4}, "class_name": "SpatialDropout1D"}, {"config": {"trainable": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null, "dtype": "float32"}, "class_name": "Orthogonal"}, "go_backwards": false, "name": "lstm", "unroll": false, "implementation": 1, "kernel_constraint": null, "return_state": false, "recurrent_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "dtype": "float32", "stateful": false, "activation": "tanh", "recurrent_constraint": null, "units": 196, "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null, "dtype": "float32"}, "class_name": "VarianceScaling"}, "unit_forget_bias": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "recurrent_activation": "hard_sigmoid", "bias_regularizer": null, "return_sequences": false, "time_major": false, "recurrent_dropout": 0.2, "dropout": 0.2}, "class_name": "LSTM"}, {"config": {"trainable": true, "name": "dense", "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null, "dtype": "float32"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "dtype": "float32", "activity_regularizer": null, "activation": "softmax", "units": 2}, "class_name": "Dense"}], "name": "sequential"}, "backend": "tensorflow", "class_name": "Sequential"}