{"keras_version": "2.2.4-tf", "class_name": "Sequential", "backend": "tensorflow", "config": {"name": "sequential", "layers": [{"class_name": "Embedding", "config": {"trainable": true, "batch_input_shape": [null, 40], "output_dim": 128, "input_length": 40, "embeddings_constraint": null, "embeddings_regularizer": null, "name": "embedding", "dtype": "float32", "mask_zero": false, "input_dim": 2000, "activity_regularizer": null, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": null, "seed": null, "dtype": "float32", "minval": 0}}}}, {"class_name": "SpatialDropout1D", "config": {"trainable": true, "rate": 0.4, "noise_shape": null, "dtype": "float32", "name": "spatial_dropout1d", "seed": null}}, {"class_name": "LSTM", "config": {"trainable": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "return_state": false, "unroll": false, "recurrent_regularizer": null, "name": "lstm", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "dtype": "float32", "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "unit_forget_bias": true, "implementation": 1, "recurrent_constraint": null, "time_major": false, "recurrent_activation": "hard_sigmoid", "recurrent_dropout": 0.2, "use_bias": true, "activation": "tanh", "dropout": 0.2, "go_backwards": false, "bias_regularizer": null, "kernel_constraint": null, "dtype": "float32", "units": 196, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "dtype": "float32", "gain": 1.0}}, "stateful": false, "activity_regularizer": null, "return_sequences": false}}, {"class_name": "Dense", "config": {"trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "dtype": "float32", "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "use_bias": true, "activation": "softmax", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "kernel_constraint": null, "name": "dense", "dtype": "float32", "units": 2, "kernel_regularizer": null, "activity_regularizer": null}}]}}