{"backend": "tensorflow", "keras_version": "2.2.4-tf", "config": {"name": "sequential", "layers": [{"config": {"input_length": 40, "embeddings_initializer": {"config": {"minval": 0, "maxval": null, "seed": null, "dtype": "float32"}, "class_name": "RandomUniform"}, "trainable": true, "activity_regularizer": null, "embeddings_regularizer": null, "dtype": "float32", "batch_input_shape": [null, 40], "embeddings_constraint": null, "output_dim": 128, "input_dim": 2000, "name": "embedding", "mask_zero": false}, "class_name": "Embedding"}, {"config": {"rate": 0.4, "noise_shape": null, "seed": null, "trainable": true, "name": "spatial_dropout1d", "dtype": "float32"}, "class_name": "SpatialDropout1D"}, {"config": {"recurrent_activation": "hard_sigmoid", "unroll": false, "time_major": false, "go_backwards": false, "bias_constraint": null, "dtype": "float32", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "stateful": false, "recurrent_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "dtype": "float32", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dropout": 0.2, "name": "lstm", "return_sequences": false, "recurrent_constraint": null, "kernel_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null, "dtype": "float32"}, "class_name": "Orthogonal"}, "recurrent_dropout": 0.2, "activation": "tanh", "unit_forget_bias": true, "trainable": true, "units": 196, "use_bias": true, "return_state": false, "kernel_constraint": null, "implementation": 1, "activity_regularizer": null, "bias_regularizer": null}, "class_name": "LSTM"}, {"config": {"kernel_regularizer": null, "bias_regularizer": null, "activation": "softmax", "activity_regularizer": null, "trainable": true, "dtype": "float32", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "units": 2, "use_bias": true, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "dtype": "float32", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "dense", "bias_constraint": null}, "class_name": "Dense"}]}, "class_name": "Sequential"}