{"config": {"layers": [{"config": {"batch_input_shape": [null, 40], "mask_zero": false, "embeddings_regularizer": null, "output_dim": 128, "input_length": 40, "embeddings_initializer": {"config": {"seed": null, "minval": 0, "maxval": null, "dtype": "float32"}, "class_name": "RandomUniform"}, "embeddings_constraint": null, "activity_regularizer": null, "input_dim": 2000, "dtype": "float32", "trainable": true, "name": "embedding"}, "class_name": "Embedding"}, {"config": {"rate": 0.4, "noise_shape": null, "dtype": "float32", "seed": null, "trainable": true, "name": "spatial_dropout1d"}, "class_name": "SpatialDropout1D"}, {"config": {"stateful": false, "go_backwards": false, "implementation": 1, "kernel_constraint": null, "recurrent_activation": "hard_sigmoid", "dropout": 0.2, "units": 196, "bias_constraint": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0, "dtype": "float32"}, "class_name": "Orthogonal"}, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "use_bias": true, "recurrent_dropout": 0.2, "unit_forget_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "name": "lstm", "recurrent_regularizer": null, "return_sequences": false, "unroll": false, "activation": "tanh", "kernel_regularizer": null, "activity_regularizer": null, "time_major": false, "dtype": "float32", "bias_regularizer": null, "return_state": false, "recurrent_constraint": null, "trainable": true}, "class_name": "LSTM"}, {"config": {"kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "units": 2, "kernel_regularizer": null, "activity_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "use_bias": true, "activation": "softmax", "dtype": "float32", "bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "dense"}, "class_name": "Dense"}], "name": "sequential"}, "keras_version": "2.2.4-tf", "backend": "tensorflow", "class_name": "Sequential"}