{"keras_version": "2.2.4-tf", "class_name": "Sequential", "backend": "tensorflow", "config": {"name": "sequential", "layers": [{"class_name": "Embedding", "config": {"embeddings_constraint": null, "activity_regularizer": null, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "seed": null, "dtype": "float32", "minval": -0.05}}, "mask_zero": false, "input_length": 40, "embeddings_regularizer": null, "output_dim": 128, "batch_input_shape": [null, 40], "dtype": "float32", "trainable": true, "input_dim": 2000, "name": "embedding"}}, {"class_name": "SpatialDropout1D", "config": {"rate": 0.4, "noise_shape": null, "seed": null, "dtype": "float32", "trainable": true, "name": "spatial_dropout1d"}}, {"class_name": "LSTM", "config": {"kernel_constraint": null, "kernel_regularizer": null, "stateful": false, "dropout": 0.2, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "recurrent_dropout": 0.2, "return_state": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "unit_forget_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null, "dtype": "float32"}}, "dtype": "float32", "name": "lstm", "implementation": 1, "activation": "tanh", "trainable": true, "return_sequences": false, "time_major": false, "unroll": false, "recurrent_constraint": null, "recurrent_regularizer": null, "go_backwards": false, "recurrent_activation": "hard_sigmoid", "use_bias": true, "activity_regularizer": null, "units": 64, "bias_regularizer": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "activation": "softmax", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "bias_regularizer": null, "use_bias": true, "dtype": "float32", "units": 2, "name": "dense"}}]}}