{"config": {"layers": [{"class_name": "Embedding", "config": {"batch_input_shape": [null, 40], "embeddings_regularizer": null, "input_dim": 2000, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"dtype": "float32", "seed": null, "minval": 0, "maxval": null}}, "activity_regularizer": null, "mask_zero": false, "name": "embedding", "dtype": "float32", "output_dim": 128, "input_length": 40, "trainable": true, "embeddings_constraint": null}}, {"class_name": "SpatialDropout1D", "config": {"noise_shape": null, "name": "spatial_dropout1d", "rate": 0.4, "seed": null, "trainable": true, "dtype": "float32"}}, {"class_name": "LSTM", "config": {"activity_regularizer": null, "kernel_regularizer": null, "return_state": false, "bias_regularizer": null, "name": "lstm", "go_backwards": false, "recurrent_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "dtype": "float32", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "time_major": false, "units": 196, "recurrent_constraint": null, "use_bias": true, "kernel_constraint": null, "implementation": 1, "return_sequences": false, "stateful": false, "bias_constraint": null, "unroll": false, "trainable": true, "dtype": "float32", "recurrent_dropout": 0.2, "unit_forget_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"dtype": "float32", "seed": null, "gain": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "recurrent_activation": "hard_sigmoid", "activation": "tanh", "dropout": 0.2}}, {"class_name": "Dense", "config": {"units": 2, "activity_regularizer": null, "bias_constraint": null, "name": "dense", "kernel_regularizer": null, "bias_regularizer": null, "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "dtype": "float32", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "trainable": true, "activation": "softmax"}}], "name": "sequential"}, "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.2.4-tf"}