{"class_name": "Sequential", "backend": "tensorflow", "config": {"name": "sequential", "layers": [{"class_name": "Embedding", "config": {"trainable": true, "batch_input_shape": [null, 40], "embeddings_regularizer": null, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": null, "seed": null, "minval": 0, "dtype": "float32"}}, "output_dim": 128, "embeddings_constraint": null, "input_length": 40, "activity_regularizer": null, "mask_zero": false, "input_dim": 2000, "name": "embedding", "dtype": "float32"}}, {"class_name": "SpatialDropout1D", "config": {"trainable": true, "seed": null, "rate": 0.4, "noise_shape": null, "name": "spatial_dropout1d", "dtype": "float32"}}, {"class_name": "LSTM", "config": {"use_bias": true, "return_state": false, "activation": "tanh", "unit_forget_bias": true, "trainable": true, "dropout": 0.2, "units": 196, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "dtype": "float32", "mode": "fan_avg"}}, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "bias_regularizer": null, "unroll": false, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "time_major": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null, "dtype": "float32"}}, "go_backwards": false, "recurrent_constraint": null, "implementation": 1, "bias_constraint": null, "kernel_regularizer": null, "recurrent_dropout": 0.2, "stateful": false, "recurrent_regularizer": null, "activity_regularizer": null, "return_sequences": false, "name": "lstm"}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activation": "softmax", "kernel_regularizer": null, "trainable": true, "units": 2, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "dtype": "float32", "mode": "fan_avg"}}, "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "name": "dense", "dtype": "float32"}}]}, "keras_version": "2.2.4-tf"}