{"class_name": "Sequential", "config": {"layers": [{"class_name": "Embedding", "config": {"batch_input_shape": [null, 40], "embeddings_regularizer": null, "input_dim": 2000, "trainable": true, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null, "dtype": "float32"}}, "activity_regularizer": null, "dtype": "float32", "mask_zero": false, "input_length": 40, "name": "embedding", "embeddings_constraint": null, "output_dim": 64}}, {"class_name": "SpatialDropout1D", "config": {"dtype": "float32", "trainable": true, "name": "spatial_dropout1d", "noise_shape": null, "seed": null, "rate": 0.4}}, {"class_name": "LSTM", "config": {"recurrent_regularizer": null, "units": 64, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "recurrent_activation": "hard_sigmoid", "bias_constraint": null, "trainable": true, "dropout": 0.2, "stateful": false, "activation": "tanh", "use_bias": true, "activity_regularizer": null, "dtype": "float32", "bias_regularizer": null, "return_sequences": false, "go_backwards": false, "name": "lstm", "recurrent_dropout": 0.2, "return_state": false, "implementation": 1, "time_major": false, "unroll": false, "unit_forget_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "dtype": "float32", "seed": null}}, "recurrent_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_constraint": null}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "units": 2, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "bias_constraint": null, "trainable": true, "activation": "softmax", "use_bias": true, "activity_regularizer": null, "dtype": "float32", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "dense", "kernel_constraint": null}}], "name": "sequential"}, "backend": "tensorflow", "keras_version": "2.2.4-tf"}