{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.2.4-tf", "config": {"name": "sequential", "layers": [{"class_name": "Embedding", "config": {"name": "embedding", "embeddings_regularizer": null, "dtype": "float32", "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": 0, "maxval": null, "seed": null, "dtype": "float32"}}, "input_length": 40, "input_dim": 2000, "batch_input_shape": [null, 40], "output_dim": 128, "trainable": true, "embeddings_constraint": null, "mask_zero": false, "activity_regularizer": null}}, {"class_name": "SpatialDropout1D", "config": {"name": "spatial_dropout1d", "noise_shape": null, "trainable": true, "dtype": "float32", "rate": 0.4, "seed": null}}, {"class_name": "LSTM", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null, "dtype": "float32"}}, "activation": "tanh", "dropout": 0.2, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null, "dtype": "float32"}}, "dtype": "float32", "kernel_regularizer": null, "return_sequences": false, "name": "lstm", "recurrent_regularizer": null, "unit_forget_bias": true, "stateful": false, "activity_regularizer": null, "time_major": false, "unroll": false, "recurrent_dropout": 0.2, "implementation": 1, "units": 196, "bias_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "return_state": false, "recurrent_constraint": null, "recurrent_activation": "hard_sigmoid", "go_backwards": false}}, {"class_name": "Dense", "config": {"name": "dense", "activation": "softmax", "units": 2, "kernel_regularizer": null, "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null, "dtype": "float32"}}, "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "activity_regularizer": null, "use_bias": true, "kernel_constraint": null}}]}}