{"config": {"layers": [{"config": {"output_dim": 128, "name": "embedding", "input_length": 40, "activity_regularizer": null, "trainable": true, "dtype": "float32", "input_dim": 2000, "embeddings_constraint": null, "embeddings_regularizer": null, "mask_zero": false, "batch_input_shape": [null, 40], "embeddings_initializer": {"config": {"maxval": null, "minval": 0, "seed": null, "dtype": "float32"}, "class_name": "RandomUniform"}}, "class_name": "Embedding"}, {"config": {"trainable": true, "dtype": "float32", "noise_shape": null, "seed": null, "name": "spatial_dropout1d", "rate": 0.4}, "class_name": "SpatialDropout1D"}, {"config": {"use_bias": true, "implementation": 1, "recurrent_dropout": 0.2, "stateful": false, "activation": "tanh", "dropout": 0.2, "return_state": false, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "recurrent_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "dtype": "float32", "bias_regularizer": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0, "dtype": "float32"}, "class_name": "Orthogonal"}, "unit_forget_bias": true, "time_major": false, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "lstm", "go_backwards": false, "activity_regularizer": null, "return_sequences": false, "trainable": true, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "kernel_constraint": null, "unroll": false, "units": 196}, "class_name": "LSTM"}, {"config": {"use_bias": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "softmax", "name": "dense", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "dtype": "float32", "kernel_constraint": null, "bias_regularizer": null, "units": 2}, "class_name": "Dense"}], "name": "sequential"}, "keras_version": "2.2.4-tf", "backend": "tensorflow", "class_name": "Sequential"}