{"class_name": "Sequential", "keras_version": "2.2.4-tf", "backend": "tensorflow", "config": {"name": "sequential", "layers": [{"class_name": "Embedding", "config": {"name": "embedding", "embeddings_regularizer": null, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"dtype": "float32", "minval": 0, "maxval": null, "seed": null}}, "dtype": "float32", "input_dim": 2000, "mask_zero": false, "embeddings_constraint": null, "trainable": true, "input_length": 40, "batch_input_shape": [null, 40], "activity_regularizer": null, "output_dim": 128}}, {"class_name": "SpatialDropout1D", "config": {"name": "spatial_dropout1d", "noise_shape": null, "seed": null, "trainable": true, "dtype": "float32", "rate": 0.4}}, {"class_name": "LSTM", "config": {"recurrent_initializer": {"class_name": "Orthogonal", "config": {"dtype": "float32", "gain": 1.0, "seed": null}}, "go_backwards": false, "bias_regularizer": null, "dtype": "float32", "units": 196, "kernel_constraint": null, "unroll": false, "return_sequences": false, "recurrent_dropout": 0.2, "activity_regularizer": null, "name": "lstm", "dropout": 0.2, "time_major": false, "recurrent_activation": "hard_sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "stateful": false, "return_state": false, "unit_forget_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "dtype": "float32", "seed": null}}, "recurrent_constraint": null, "use_bias": true, "recurrent_regularizer": null, "implementation": 1, "trainable": true, "bias_constraint": null, "kernel_regularizer": null, "activation": "tanh"}}, {"class_name": "Dense", "config": {"name": "dense", "bias_regularizer": null, "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "dtype": "float32", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "units": 2, "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "trainable": true, "activity_regularizer": null, "kernel_regularizer": null, "activation": "softmax"}}]}}