{"class_name": "Sequential", "keras_version": "2.2.4-tf", "backend": "tensorflow", "config": {"layers": [{"class_name": "Embedding", "config": {"dtype": "float32", "mask_zero": false, "name": "embedding", "activity_regularizer": null, "batch_input_shape": [null, 40], "trainable": true, "embeddings_regularizer": null, "embeddings_constraint": null, "input_length": 40, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "dtype": "float32", "minval": 0, "maxval": null}}, "input_dim": 2000, "output_dim": 128}}, {"class_name": "SpatialDropout1D", "config": {"dtype": "float32", "seed": null, "name": "spatial_dropout1d", "noise_shape": null, "trainable": true, "rate": 0.4}}, {"class_name": "LSTM", "config": {"unit_forget_bias": true, "use_bias": true, "time_major": false, "kernel_regularizer": null, "units": 196, "recurrent_dropout": 0.2, "recurrent_constraint": null, "return_state": false, "recurrent_regularizer": null, "dtype": "float32", "stateful": false, "name": "lstm", "activation": "tanh", "activity_regularizer": null, "return_sequences": false, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "dtype": "float32", "gain": 1.0}}, "kernel_constraint": null, "dropout": 0.2, "go_backwards": false, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform", "dtype": "float32"}}, "bias_constraint": null, "unroll": false, "implementation": 1}}, {"class_name": "Dense", "config": {"dtype": "float32", "name": "dense", "activation": "softmax", "activity_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "units": 2, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform", "dtype": "float32"}}}}], "name": "sequential"}}