{"backend": "tensorflow", "keras_version": "2.2.4-tf", "class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "Embedding", "config": {"input_dim": 2000, "output_dim": 64, "batch_input_shape": [null, 40], "embeddings_initializer": {"class_name": "RandomUniform", "config": {"dtype": "float32", "minval": -0.05, "seed": null, "maxval": 0.05}}, "embeddings_regularizer": null, "mask_zero": false, "trainable": true, "input_length": 40, "embeddings_constraint": null, "name": "embedding", "dtype": "float32", "activity_regularizer": null}}, {"class_name": "SpatialDropout1D", "config": {"trainable": true, "noise_shape": null, "seed": null, "name": "spatial_dropout1d", "rate": 0.4, "dtype": "float32"}}, {"class_name": "LSTM", "config": {"time_major": false, "kernel_regularizer": null, "unroll": false, "recurrent_constraint": null, "recurrent_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "dtype": "float32", "seed": null}}, "unit_forget_bias": true, "recurrent_dropout": 0.2, "units": 256, "implementation": 1, "dtype": "float32", "activity_regularizer": null, "return_state": false, "return_sequences": false, "bias_constraint": null, "use_bias": true, "go_backwards": false, "stateful": false, "bias_regularizer": null, "dropout": 0.2, "trainable": true, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "name": "lstm", "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"class_name": "Dense", "config": {"bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "units": 2, "bias_regularizer": null, "name": "dense", "dtype": "float32", "activity_regularizer": null, "activation": "softmax"}}]}}