{"backend": "tensorflow", "config": {"name": "sequential", "layers": [{"config": {"batch_input_shape": [null, 40], "dtype": "float32", "input_length": 40, "input_dim": 2000, "mask_zero": false, "embeddings_initializer": {"config": {"dtype": "float32", "minval": 0, "maxval": null, "seed": null}, "class_name": "RandomUniform"}, "name": "embedding", "embeddings_constraint": null, "trainable": true, "activity_regularizer": null, "output_dim": 128, "embeddings_regularizer": null}, "class_name": "Embedding"}, {"config": {"dtype": "float32", "rate": 0.4, "trainable": true, "name": "spatial_dropout1d", "noise_shape": null, "seed": null}, "class_name": "SpatialDropout1D"}, {"config": {"dtype": "float32", "recurrent_initializer": {"config": {"dtype": "float32", "gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "name": "lstm", "activation": "tanh", "implementation": 1, "use_bias": true, "units": 196, "activity_regularizer": null, "time_major": false, "return_sequences": false, "dropout": 0.2, "kernel_regularizer": null, "go_backwards": false, "bias_constraint": null, "return_state": false, "recurrent_activation": "hard_sigmoid", "unroll": false, "recurrent_regularizer": null, "recurrent_constraint": null, "stateful": false, "trainable": true, "recurrent_dropout": 0.2, "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "unit_forget_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "dtype": "float32", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "LSTM"}, {"config": {"bias_constraint": null, "dtype": "float32", "name": "dense", "activation": "softmax", "units": 2, "trainable": true, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "dtype": "float32", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}, "class_name": "Dense"}]}, "class_name": "Sequential", "keras_version": "2.2.4-tf"}