{"keras_version": "2.2.4-tf", "config": {"name": "sequential", "layers": [{"config": {"mask_zero": false, "activity_regularizer": null, "name": "embedding", "trainable": true, "embeddings_initializer": {"config": {"minval": 0, "dtype": "float32", "maxval": null, "seed": null}, "class_name": "RandomUniform"}, "embeddings_constraint": null, "embeddings_regularizer": null, "output_dim": 128, "dtype": "float32", "batch_input_shape": [null, 40], "input_dim": 2000, "input_length": 40}, "class_name": "Embedding"}, {"config": {"dtype": "float32", "name": "spatial_dropout1d", "trainable": true, "rate": 0.4, "noise_shape": null, "seed": null}, "class_name": "SpatialDropout1D"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "dtype": "float32", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "recurrent_constraint": null, "name": "lstm", "kernel_regularizer": null, "time_major": false, "recurrent_activation": "hard_sigmoid", "implementation": 1, "units": 196, "return_state": false, "dtype": "float32", "unit_forget_bias": true, "return_sequences": false, "go_backwards": false, "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "trainable": true, "recurrent_initializer": {"config": {"gain": 1.0, "dtype": "float32", "seed": null}, "class_name": "Orthogonal"}, "stateful": false, "kernel_constraint": null, "dropout": 0.2, "activation": "tanh", "unroll": false, "recurrent_dropout": 0.2, "activity_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "recurrent_regularizer": null}, "class_name": "LSTM"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "dtype": "float32", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "name": "dense", "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "units": 2, "dtype": "float32", "activation": "softmax", "kernel_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_constraint": null}, "class_name": "Dense"}]}, "class_name": "Sequential", "backend": "tensorflow"}