{"class_name": "Sequential", "keras_version": "2.2.4-tf", "config": {"layers": [{"class_name": "Embedding", "config": {"input_dim": 2000, "output_dim": 128, "name": "embedding", "mask_zero": false, "dtype": "float32", "batch_input_shape": [null, 40], "embeddings_regularizer": null, "input_length": 40, "trainable": true, "activity_regularizer": null, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": 0, "dtype": "float32", "maxval": null, "seed": null}}, "embeddings_constraint": null}}, {"class_name": "SpatialDropout1D", "config": {"rate": 0.4, "trainable": true, "name": "spatial_dropout1d", "dtype": "float32", "noise_shape": null, "seed": null}}, {"class_name": "LSTM", "config": {"trainable": true, "bias_regularizer": null, "dtype": "float32", "return_state": false, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "use_bias": true, "time_major": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null, "dtype": "float32"}}, "implementation": 1, "activity_regularizer": null, "bias_constraint": null, "recurrent_regularizer": null, "unroll": false, "units": 196, "recurrent_activation": "hard_sigmoid", "name": "lstm", "activation": "tanh", "stateful": false, "kernel_constraint": null, "unit_forget_bias": true, "dropout": 0.2, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"dtype": "float32", "gain": 1.0, "seed": null}}, "go_backwards": false, "return_sequences": false, "recurrent_constraint": null, "recurrent_dropout": 0.2}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "dtype": "float32", "trainable": true, "name": "dense", "bias_regularizer": null, "activation": "softmax", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null, "dtype": "float32"}}, "activity_regularizer": null, "bias_constraint": null, "units": 2}}], "name": "sequential"}, "backend": "tensorflow"}