{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.2.4-tf", "config": {"name": "sequential", "layers": [{"class_name": "Embedding", "config": {"trainable": true, "embeddings_regularizer": null, "batch_input_shape": [null, 40], "activity_regularizer": null, "dtype": "float32", "name": "embedding", "input_length": 40, "output_dim": 64, "mask_zero": false, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "minval": -0.05, "seed": null, "dtype": "float32"}}, "embeddings_constraint": null, "input_dim": 2000}}, {"class_name": "SpatialDropout1D", "config": {"trainable": true, "rate": 0.4, "seed": null, "dtype": "float32", "name": "spatial_dropout1d", "noise_shape": null}}, {"class_name": "LSTM", "config": {"dropout": 0.2, "use_bias": true, "dtype": "float32", "units": 128, "kernel_constraint": null, "recurrent_regularizer": null, "kernel_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null, "dtype": "float32"}}, "time_major": false, "trainable": true, "implementation": 1, "activity_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "name": "lstm", "unroll": false, "activation": "tanh", "recurrent_constraint": null, "recurrent_activation": "hard_sigmoid", "go_backwards": false, "return_state": false, "stateful": false, "bias_regularizer": null, "recurrent_dropout": 0.2, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "return_sequences": false, "bias_constraint": null, "unit_forget_bias": true}}, {"class_name": "Dense", "config": {"trainable": true, "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "dtype": "float32", "units": 2, "kernel_constraint": null, "name": "dense", "activation": "softmax", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null}}]}}