{"config": {"name": "sequential", "layers": [{"config": {"embeddings_constraint": null, "embeddings_regularizer": null, "dtype": "float32", "mask_zero": false, "trainable": true, "batch_input_shape": [null, 40], "name": "embedding", "input_length": 40, "output_dim": 128, "embeddings_initializer": {"config": {"minval": 0, "dtype": "float32", "seed": null, "maxval": null}, "class_name": "RandomUniform"}, "activity_regularizer": null, "input_dim": 2000}, "class_name": "Embedding"}, {"config": {"name": "spatial_dropout1d", "seed": null, "noise_shape": null, "dtype": "float32", "rate": 0.4, "trainable": true}, "class_name": "SpatialDropout1D"}, {"config": {"implementation": 1, "recurrent_activation": "hard_sigmoid", "kernel_initializer": {"config": {"dtype": "float32", "seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "recurrent_constraint": null, "unit_forget_bias": true, "recurrent_dropout": 0.2, "trainable": true, "go_backwards": false, "units": 196, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "return_sequences": false, "kernel_constraint": null, "stateful": false, "kernel_regularizer": null, "unroll": false, "bias_constraint": null, "recurrent_regularizer": null, "dtype": "float32", "return_state": false, "time_major": false, "activation": "tanh", "name": "lstm", "use_bias": true, "dropout": 0.2, "recurrent_initializer": {"config": {"dtype": "float32", "seed": null, "gain": 1.0}, "class_name": "Orthogonal"}}, "class_name": "LSTM"}, {"config": {"name": "dense", "kernel_regularizer": null, "kernel_initializer": {"config": {"dtype": "float32", "seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "dtype": "float32", "activation": "softmax", "kernel_constraint": null, "trainable": true, "use_bias": true, "units": 2, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}, "class_name": "Dense"}]}, "backend": "tensorflow", "keras_version": "2.2.4-tf", "class_name": "Sequential"}