{"backend": "tensorflow", "config": {"name": "sequential", "layers": [{"config": {"dtype": "float32", "input_length": 40, "input_dim": 2000, "activity_regularizer": null, "mask_zero": false, "embeddings_regularizer": null, "embeddings_initializer": {"config": {"dtype": "float32", "maxval": 0.05, "minval": -0.05, "seed": null}, "class_name": "RandomUniform"}, "name": "embedding", "trainable": true, "output_dim": 256, "batch_input_shape": [null, 40], "embeddings_constraint": null}, "class_name": "Embedding"}, {"config": {"name": "spatial_dropout1d", "dtype": "float32", "trainable": true, "noise_shape": null, "seed": null, "rate": 0.4}, "class_name": "SpatialDropout1D"}, {"config": {"unit_forget_bias": true, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "use_bias": true, "return_state": false, "return_sequences": false, "kernel_constraint": null, "name": "lstm", "recurrent_initializer": {"config": {"dtype": "float32", "gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "recurrent_regularizer": null, "unroll": false, "stateful": false, "go_backwards": false, "dropout": 0.2, "kernel_regularizer": null, "activity_regularizer": null, "dtype": "float32", "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "units": 64, "trainable": true, "bias_regularizer": null, "recurrent_dropout": 0.2, "activation": "tanh", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_constraint": null, "implementation": 1, "time_major": false}, "class_name": "LSTM"}, {"config": {"dtype": "float32", "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "activity_regularizer": null, "use_bias": true, "units": 2, "bias_regularizer": null, "kernel_constraint": null, "name": "dense", "trainable": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_constraint": null, "activation": "softmax", "kernel_regularizer": null}, "class_name": "Dense"}]}, "class_name": "Sequential", "keras_version": "2.2.4-tf"}