{"keras_version": "2.2.4-tf", "config": {"layers": [{"class_name": "Embedding", "config": {"embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": 0, "maxval": null, "dtype": "float32", "seed": null}}, "embeddings_constraint": null, "trainable": true, "dtype": "float32", "output_dim": 128, "batch_input_shape": [null, 40], "name": "embedding", "input_length": 40, "activity_regularizer": null, "mask_zero": false, "input_dim": 2000, "embeddings_regularizer": null}}, {"class_name": "SpatialDropout1D", "config": {"seed": null, "trainable": true, "name": "spatial_dropout1d", "noise_shape": null, "rate": 0.4, "dtype": "float32"}}, {"class_name": "LSTM", "config": {"recurrent_activation": "hard_sigmoid", "return_sequences": false, "return_state": false, "unroll": false, "implementation": 1, "recurrent_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null, "dtype": "float32"}}, "go_backwards": false, "name": "lstm", "stateful": false, "activation": "tanh", "dropout": 0.2, "use_bias": true, "recurrent_dropout": 0.2, "trainable": true, "units": 196, "bias_constraint": null, "recurrent_regularizer": null, "time_major": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null, "dtype": "float32"}}, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "unit_forget_bias": true, "dtype": "float32"}}, {"class_name": "Dense", "config": {"units": 2, "trainable": true, "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "dense", "kernel_constraint": null, "activity_regularizer": null, "activation": "softmax", "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "bias_constraint": null}}], "name": "sequential"}, "class_name": "Sequential", "backend": "tensorflow"}