{"config": {"name": "sequential", "layers": [{"config": {"dtype": "float32", "trainable": true, "input_length": 40, "activity_regularizer": null, "embeddings_regularizer": null, "input_dim": 2000, "output_dim": 128, "embeddings_initializer": {"config": {"dtype": "float32", "maxval": null, "minval": 0, "seed": null}, "class_name": "RandomUniform"}, "embeddings_constraint": null, "name": "embedding", "mask_zero": false, "batch_input_shape": [null, 40]}, "class_name": "Embedding"}, {"config": {"dtype": "float32", "rate": 0.4, "trainable": true, "name": "spatial_dropout1d", "seed": null, "noise_shape": null}, "class_name": "SpatialDropout1D"}, {"config": {"time_major": false, "trainable": true, "use_bias": true, "recurrent_constraint": null, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "stateful": false, "bias_regularizer": null, "dropout": 0.2, "kernel_constraint": null, "activation": "tanh", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"dtype": "float32", "scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "go_backwards": false, "recurrent_initializer": {"config": {"dtype": "float32", "gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "activity_regularizer": null, "recurrent_dropout": 0.2, "return_sequences": false, "dtype": "float32", "return_state": false, "implementation": 1, "unroll": false, "name": "lstm", "units": 196, "unit_forget_bias": true, "kernel_regularizer": null}, "class_name": "LSTM"}, {"config": {"bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "dtype": "float32", "trainable": true, "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"config": {"dtype": "float32", "scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "units": 2, "bias_constraint": null, "bias_regularizer": null, "name": "dense", "kernel_constraint": null, "kernel_regularizer": null, "activation": "softmax"}, "class_name": "Dense"}]}, "keras_version": "2.2.4-tf", "backend": "tensorflow", "class_name": "Sequential"}