{"keras_version": "2.2.4-tf", "class_name": "Sequential", "backend": "tensorflow", "config": {"layers": [{"class_name": "Embedding", "config": {"embeddings_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "minval": -0.05, "maxval": 0.05, "dtype": "float32"}}, "dtype": "float32", "output_dim": 256, "batch_input_shape": [null, 40], "embeddings_regularizer": null, "input_length": 40, "mask_zero": false, "name": "embedding", "activity_regularizer": null, "embeddings_constraint": null, "trainable": true, "input_dim": 2000}}, {"class_name": "SpatialDropout1D", "config": {"seed": null, "name": "spatial_dropout1d", "dtype": "float32", "rate": 0.4, "trainable": true, "noise_shape": null}}, {"class_name": "LSTM", "config": {"activation": "tanh", "recurrent_activation": "hard_sigmoid", "units": 256, "kernel_regularizer": null, "unroll": false, "kernel_constraint": null, "bias_regularizer": null, "name": "lstm", "bias_constraint": null, "use_bias": true, "implementation": 1, "dtype": "float32", "dropout": 0.2, "recurrent_constraint": null, "stateful": false, "return_sequences": false, "go_backwards": false, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "time_major": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "activity_regularizer": null, "recurrent_dropout": 0.2, "unit_forget_bias": true, "return_state": false, "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null, "dtype": "float32"}}, "recurrent_regularizer": null}}, {"class_name": "Dense", "config": {"dtype": "float32", "activation": "softmax", "units": 2, "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "dense", "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "trainable": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}}}], "name": "sequential"}}