{"class_name": "Sequential", "config": {"layers": [{"class_name": "Embedding", "config": {"activity_regularizer": null, "input_dim": 2000, "output_dim": 128, "dtype": "float32", "trainable": true, "embeddings_regularizer": null, "batch_input_shape": [null, 40], "mask_zero": false, "embeddings_constraint": null, "input_length": 40, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"dtype": "float32", "maxval": null, "seed": null, "minval": 0}}, "name": "embedding"}}, {"class_name": "SpatialDropout1D", "config": {"rate": 0.4, "dtype": "float32", "trainable": true, "noise_shape": null, "seed": null, "name": "spatial_dropout1d"}}, {"class_name": "LSTM", "config": {"stateful": false, "trainable": true, "implementation": 1, "return_state": false, "dropout": 0.2, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"dtype": "float32", "gain": 1.0, "seed": null}}, "return_sequences": false, "recurrent_regularizer": null, "kernel_regularizer": null, "go_backwards": false, "dtype": "float32", "bias_regularizer": null, "bias_constraint": null, "name": "lstm", "time_major": false, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "units": 196, "unit_forget_bias": true, "kernel_constraint": null, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "recurrent_dropout": 0.2, "use_bias": true, "recurrent_constraint": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "trainable": true, "use_bias": true, "units": 2, "bias_constraint": null, "dtype": "float32", "kernel_regularizer": null, "kernel_constraint": null, "activation": "softmax", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "dense"}}], "name": "sequential"}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}