{"backend": "tensorflow", "keras_version": "2.2.4-tf", "class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "Embedding", "config": {"activity_regularizer": null, "embeddings_constraint": null, "input_dim": 2000, "input_length": 40, "trainable": true, "dtype": "float32", "output_dim": 256, "name": "embedding", "batch_input_shape": [null, 40], "embeddings_initializer": {"class_name": "RandomUniform", "config": {"dtype": "float32", "minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "mask_zero": false}}, {"class_name": "SpatialDropout1D", "config": {"dtype": "float32", "name": "spatial_dropout1d", "rate": 0.4, "seed": null, "noise_shape": null, "trainable": true}}, {"class_name": "LSTM", "config": {"kernel_constraint": null, "return_state": false, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"dtype": "float32", "seed": null, "gain": 1.0}}, "implementation": 1, "units": 128, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "return_sequences": false, "recurrent_constraint": null, "recurrent_dropout": 0.2, "activation": "tanh", "stateful": false, "dropout": 0.2, "recurrent_regularizer": null, "time_major": false, "activity_regularizer": null, "use_bias": true, "go_backwards": false, "dtype": "float32", "name": "lstm", "unit_forget_bias": true, "recurrent_activation": "hard_sigmoid", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "kernel_regularizer": null, "unroll": false}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "name": "dense", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "units": 2, "bias_regularizer": null, "trainable": true, "dtype": "float32", "bias_constraint": null, "use_bias": true, "activation": "softmax", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "kernel_regularizer": null}}]}}