{"keras_version": "2.2.4-tf", "class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "Embedding", "config": {"embeddings_constraint": null, "embeddings_regularizer": null, "batch_input_shape": [null, 40], "output_dim": 128, "name": "embedding", "trainable": true, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "minval": 0, "dtype": "float32", "maxval": null}}, "dtype": "float32", "activity_regularizer": null, "input_length": 40, "input_dim": 2000, "mask_zero": false}}, {"class_name": "SpatialDropout1D", "config": {"name": "spatial_dropout1d", "dtype": "float32", "seed": null, "trainable": true, "rate": 0.4, "noise_shape": null}}, {"class_name": "LSTM", "config": {"time_major": false, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "dtype": "float32", "seed": null, "scale": 1.0}}, "dropout": 0.2, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "lstm", "return_sequences": false, "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0, "dtype": "float32"}}, "recurrent_dropout": 0.2, "activity_regularizer": null, "unit_forget_bias": true, "implementation": 1, "bias_regularizer": null, "recurrent_regularizer": null, "stateful": false, "kernel_regularizer": null, "dtype": "float32", "bias_constraint": null, "go_backwards": false, "kernel_constraint": null, "return_state": false, "recurrent_activation": "hard_sigmoid", "units": 196, "unroll": false, "recurrent_constraint": null}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "dtype": "float32", "seed": null, "scale": 1.0}}, "kernel_regularizer": null, "units": 2, "activation": "softmax", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "dense", "kernel_constraint": null, "trainable": true, "dtype": "float32", "activity_regularizer": null}}]}, "backend": "tensorflow"}