{"backend": "tensorflow", "class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "Embedding", "config": {"input_dim": 2000, "dtype": "float32", "name": "embedding", "input_length": 40, "output_dim": 128, "embeddings_constraint": null, "embeddings_regularizer": null, "trainable": true, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "dtype": "float32", "minval": 0, "maxval": null}}, "mask_zero": false, "batch_input_shape": [null, 40], "activity_regularizer": null}}, {"class_name": "SpatialDropout1D", "config": {"noise_shape": null, "dtype": "float32", "seed": null, "name": "spatial_dropout1d", "rate": 0.4, "trainable": true}}, {"class_name": "LSTM", "config": {"go_backwards": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "dtype": "float32", "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "dtype": "float32", "gain": 1.0}}, "bias_constraint": null, "unit_forget_bias": true, "recurrent_dropout": 0.2, "name": "lstm", "trainable": true, "use_bias": true, "unroll": false, "return_state": false, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "recurrent_constraint": null, "implementation": 1, "recurrent_activation": "hard_sigmoid", "bias_regularizer": null, "return_sequences": false, "kernel_regularizer": null, "recurrent_regularizer": null, "activation": "tanh", "time_major": false, "units": 196, "kernel_constraint": null, "dtype": "float32", "dropout": 0.2, "activity_regularizer": null, "stateful": false}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "dtype": "float32", "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "name": "dense", "trainable": true, "activation": "softmax", "use_bias": true, "units": 2, "kernel_constraint": null, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "activity_regularizer": null}}]}, "keras_version": "2.2.4-tf"}