{"keras_version": "2.2.4-tf", "backend": "tensorflow", "class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "Embedding", "config": {"activity_regularizer": null, "dtype": "float32", "input_length": 40, "output_dim": 128, "embeddings_regularizer": null, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": 0, "seed": null, "maxval": null, "dtype": "float32"}}, "trainable": true, "input_dim": 2000, "name": "embedding", "mask_zero": false, "batch_input_shape": [null, 40], "embeddings_constraint": null}}, {"class_name": "SpatialDropout1D", "config": {"noise_shape": null, "dtype": "float32", "rate": 0.4, "name": "spatial_dropout1d", "seed": null, "trainable": true}}, {"class_name": "LSTM", "config": {"units": 196, "dtype": "float32", "recurrent_dropout": 0.2, "time_major": false, "go_backwards": false, "recurrent_activation": "hard_sigmoid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "dtype": "float32", "mode": "fan_avg"}}, "stateful": false, "bias_regularizer": null, "bias_constraint": null, "recurrent_constraint": null, "implementation": 1, "activity_regularizer": null, "activation": "tanh", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0, "dtype": "float32"}}, "unroll": false, "recurrent_regularizer": null, "unit_forget_bias": true, "return_sequences": false, "trainable": true, "dropout": 0.2, "return_state": false, "name": "lstm", "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_constraint": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "bias_regularizer": null, "units": 2, "dtype": "float32", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "activation": "softmax", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "dtype": "float32", "mode": "fan_avg"}}, "name": "dense", "kernel_regularizer": null, "bias_constraint": null, "kernel_constraint": null}}]}}