{"class_name": "Sequential", "config": {"layers": [{"class_name": "Embedding", "config": {"batch_input_shape": [null, 40], "input_length": 40, "output_dim": 128, "embeddings_constraint": null, "dtype": "float32", "embeddings_regularizer": null, "trainable": true, "input_dim": 2000, "name": "embedding", "embeddings_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "dtype": "float32", "minval": 0, "maxval": null}}, "mask_zero": false, "activity_regularizer": null}}, {"class_name": "SpatialDropout1D", "config": {"rate": 0.4, "seed": null, "trainable": true, "noise_shape": null, "name": "spatial_dropout1d", "dtype": "float32"}}, {"class_name": "LSTM", "config": {"stateful": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "dtype": "float32", "gain": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "unit_forget_bias": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "dtype": "float32", "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "trainable": true, "name": "lstm", "recurrent_dropout": 0.2, "kernel_regularizer": null, "units": 196, "return_state": false, "recurrent_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "dropout": 0.2, "activation": "tanh", "unroll": false, "recurrent_constraint": null, "return_sequences": false, "implementation": 1, "time_major": false, "go_backwards": false, "bias_constraint": null, "use_bias": true, "recurrent_activation": "hard_sigmoid"}}, {"class_name": "Dense", "config": {"activation": "softmax", "name": "dense", "dtype": "float32", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "dtype": "float32", "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "units": 2, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null}}], "name": "sequential"}, "backend": "tensorflow", "keras_version": "2.2.4-tf"}